Repository: ministryofjustice/website-builder-blocks
Catalog: languages/wb_blocks-*.po
Languages: cy

source: Date prefix
cy: Rhagddodiad y dyddiad

source: Show prefix before date
cy: Dangos y rhagddodiad cyn y dyddiad

source: Published
cy: Cyhoeddwyd

source: Updated
cy: Diweddarwyd

source: Type the prefix inline before the date (e.g., %s).
cy: Teipiwch y rhagddodiad yn syth cyn y dyddiad (e.e., %s).

source: Adds text (e.g. %s) before the post date.
cy: Yn ychwanegu testun (e.e. %s) cyn dyddiad y post.

source: Prefix…
cy: Rhagddodiad…

source: Displaying %1$s – %2$s of %3$s
cy: Yn dangos %1$s – %2$s o %3$s

source: Displaying %1$s of %2$s
cy: Yn dangos %1$s o %2$s

source: Showing %1$s to %2$s of %3$s results
cy: Yn dangos %1$s i %2$s o %3$s o ganlyniadau

source: Showing %1$s of %2$s results
cy: Yn dangos %1$s o %2$s

source: Enter your own phrase format
cy: Rhowch eich fformat ymadrodd eich hun

source: Single item format
cy: Fformat eitem sengl

source: Range format
cy: Fformat amrediad

source: Use placeholders: %1$s (index), %2$s (total).
cy: efnyddiwch ddewisyddion: %1$s (mynegai), %2$s (cyfanswm).

source: Use placeholders: %1$s (start), %2$s (end), %3$s (total).
cy: Defnyddiwch ddewisyddion: %1$s (cychwyn), %2$s (diwedd), %3$s (cyfanswm).

source: For bold text use tags: <b> & </b>.
cy: Ar gyfer testun trwm defnyddiwch dagiau: <b> a </b>.

source: Page %1$d of %2$d
cy: Tudalen %1$d o %2$d

source: Show when no results
cy: Dangos pan nad oes canlyniadau

source: Display this block when a query returns no results
cy: Dangos y bloc hwn pan nad yw ymholiad yn dychwelyd unrhyw ganlyniadau

source: Bold numbers
cy: Rhifau trwm

source: Centred on mobile
cy: Canoli ar symudol
